Autodesk.Revit.ApplicationServices.ControlledApplication.SubVersionNumber
The minor version number of Revit.
Remarks:
SubVersionNumber of Revit may have additional APIs and functionality not available in the standard customer releases.
Add-ins written to support standard Revit releases should be compatible with SubVersionNumber releases,
but add-ins written specifically targeting new features in SubVersionNumber releases would not be compatible with the standard releases.
Since:
2018.1

Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUsersAddinsDataFolderPath
Path to AddinsData folder for the current user.

Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUsersDataFolderPath
Path to data folder for the current user.

Autodesk.Revit.ApplicationServices.ControlledApplication.AllUsersAddinsLocation
Add-ins location for all users.

Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUserAddinsLocation
Add-ins location for current user.

Autodesk.Revit.ApplicationServices.ControlledApplication.ElementTypeDuplicated
Subscribe to the ElementTypeDuplicated event to be notified immediately after Revit has finished duplicating an element type.
Remarks:
This event is raised immediately after Revit has finished duplicating an element type.
It is raised even when duplicating an element type failed or was cancelled (during ElementTypeDuplicating event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of importing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.ElementTypeDuplicating
Subscribe to the ElementTypeDuplicating event to be notified when Revit is just about to duplicate an element type.
Remarks:
This event is raised when Revit is just about to duplicate an element type.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Import()Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.ElementTypeDuplicated event will be raised immediately after duplicating an element type is finished.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.FamilyLoadedIntoDocument
Subscribe to the FamilyLoadedInto event to be notified after Revit loaded a family into a document.
Remarks:
This event is raised immediately after Revit has finished loading a family into a document.
It is raised even when family loading failed or was cancelled (during FamilyLoadingIntoDocument event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of importing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.FamilyLoadingIntoDocument
Subscribe to the FamilyLoadingInto event to be notified when Revit is just about to load a family into a document.
Remarks:
This event is raised when Revit is just about to load a family into a document.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Import()Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.FamilyLoadedIntoDocument event will be raised immediately after family loading
is finished.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.ApplicationInitialized
Subscribe to this event to get notified after the Revit application has been initialized.
Remarks:
The event is raised after Revit was launched as fully initialized, including initialization of external applications.
The event is not cancellable; the 'Cancellable' property of the event's argument is always False.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.ProgressChanged
Subscribe to the ProgressChanged event to be notified when an operation in Revit has progress bar data available.
Remarks:
Handlers of this event may use the Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Cancel method to cancel the operation tracked by the progress bar.
Users may not change the document in the handler for this event.
Exception Autodesk.Revit.Exceptions.ModificationForbiddenException will be thrown if any document-modifying method is called during this event's handler.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSynchronizedWithCentral
Subscribe to the DocumentSynchronizedWithCentral event to be notified immediately after Revit has finished synchronizing a document with central model.
Remarks:
This event is raised immediately after Revit has finished synchronizing a document with central model.
It is raised even when document synchronizing with central model failed or was cancelled (during DocumentSynchronizingWithCentral event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in the event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of synchronizing a document with central model has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSynchronizingWithCentral
Subscribe to the DocumentSynchronizingWithCentral event to be notified when Revit is just about to synchronize a document with central model.
Remarks:
This event is raised when Revit is just about to synchronize a document with central model.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentSynchronizedWithCentral event will be raised immediately after document synchronizing with central model
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentOpened
Subscribe to the DocumentOpened event to be notified immediately after Revit has finished opening a document.
Remarks:
This event is raised immediately after Revit has finished opening a document.
It is raised even when document opening failed or was cancelled (during DocumentOpening event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of opening document has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentOpening
Subscribe to the DocumentOpening event to be notified when Revit is just about to open a document.
Remarks:
This event is raised when Revit is just about to open a document.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document cannot be modified, for it is not opened yet at the time of the event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentOpened event will be raised immediately after document
is opened.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.FileExported
Subscribe to the FileExported event to be notified immediately after Revit has finished exporting files of formats supported by the API.
Remarks:
This event is raised immediately after Revit has finished exporting files of formats supported by the API.
It is raised even when file exporting failed or was cancelled (during FileExporting event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
If export is a part of ‘Publish to Buzzsaw' command which consists of two parts – export of a document followed by publishing it to a BuzzSaw server, the event status only reflects the result of the Export action. The publishing part of the command could still be cancelled or could fail after FileExported event is raised.
This event is not cancellable, for the process of exporting file has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.FileExporting
Subscribe to the FileExporting event to be notified when Revit is just about to export files of formats supported by the API.
Remarks:
This event is raised when Revit is just about to export files of formats supported by the API.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk.Revit.Document.Print()Autodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.FileExported event will be raised immediately after file exporting
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.FileImported
Subscribe to the FileImported event to be notified immediately after Revit has finished importing a file of format supported by the API.
Remarks:
This event is raised immediately after Revit has finished importing a file of format supported by the API.
It is raised even when file importing failed or was cancelled (during FileImporting event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of importing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.FileImporting
Subscribe to the FileImporting event to be notified when Revit is just about to import a file of format supported by the API.
Remarks:
This event is raised when Revit is just about to import a file of format supported by the API.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Import()Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.FileImported event will be raised immediately after file importing
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentCreated
Subscribe to the DocumentCreated event to be notified immediately after Revit has finished creating a new document.
Remarks:
This event is raised immediately after Revit has finished creating a new document.
It is raised even when document creation failed or was cancelled (during DocumentCreating event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of document creation has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentCreating
Subscribe to the DocumentCreating event to be notified when Revit is just about to create a new document.
Remarks:
This event is raised when Revit is just about to create a new document.
Event is cancellable. To cancel it, call the 'Cancel()' method of event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document cannot be modified, for it is not created yet at the time of the event.
The following API functions are not available for the current document during this event:
Autodesk::Revit::ApplicationServices::Application::NewProjectDocument()Autodesk.Revit.ApplicationServices.Application.NewFamilyDocument(System.String)Autodesk.Revit.ApplicationServices.Application.NewProjectTemplateDocument(System.String)Autodesk.Revit.ApplicationServices.Application.OpenDocumentFile(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentCreated event will be raised immediately after document
creation is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentClosed
Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
Remarks:
This event is raised immediately after Revit has finished closing a document.
It is raised even when document closing failed or was cancelled (during DocumentClosing event).
This event is not cancellable, for the process of closing document has already been finished.
The document cannot be modified because the corresponding object does not exist anymore.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentClosing
Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
Remarks:
This event is raised when Revit is just about to close a document.
This event is cancellable, except when it is raised during close of the application.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, set the 'Cancel' property in event's argument to True to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document may not be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.ApplicationServices.Application.DocumentClosed event will be raised immediately after document is closed.
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.ViewPrinted
Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
Remarks:
This event is raised immediately after Revit has finished printing a view of the document.
If multiple views are combined to a single file, this event will be raised only once.
It is raised even when view printing failed.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action was successful or not.
This event is not cancellable, for the process of view printing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.

Autodesk.Revit.ApplicationServices.ControlledApplication.ViewPrinting
Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
Remarks:
This event is raised when Revit is just about to print a view of the document.
If multiple views are combined to a single file, this event will be raised only once.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk.Revit.DB.Document.Print()Autodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.ViewPrinted will be raised immediately after view printing
is finished.

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentPrinted
Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
Remarks:
This event is raised immediately after Revit has finished printing a view or ViewSet of the document.
It is raised even when document printing failed or was cancelled (during DocumentPriting event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of printing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentPrinting
Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
Remarks:
This event is raised when Revit is just about to print a view or ViewSet of the document.
This document-level event precedes the application-level event of the same name.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method of event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk::Revit::DB::Document::PrintAutodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
After this event, for each view being printed, Autodesk::Revit::ApplicationServices::Application::ViewPrinting and Autodesk::Revit::ApplicationServices::Application::ViewPrinted events will be raised.
Another event Autodesk.Revit.DB.Document.DocumentPrinted will be raised immediately after document printing
is finished.

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSavedAs
Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
Remarks:
This event is raised immediately after Revit has finished saving document with a new file name.
Note that the first save of a newly created document  will raise DocumentSavedAs rather than Autodesk.Revit.ApplicationServices.Application.DocumentSaved event.
It is raised even when document saving failed or was cancelled (during DocumentSavingAs event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' property in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of saving document has already been finished.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSavingAs
Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
This event is raised when Revit is just about to save the document with a new file name.
Note that the first save of a newly created document  will raise DocumentSavingAs rather than Autodesk.Revit.ApplicationServices.Application.DocumentSaving event.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
This event is cancellable, except when it is raised during close of the application.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.Another event Autodesk.Revit.ApplicationServices.Application.DocumentSavedAs will be raised immediately after the document has been saved with a new file name.

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSaved
Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
Remarks:
This event is raised immediately after Revit has finished saving a document.
Note that the first save of a newly created document  will raise Autodesk.Revit.ApplicationServices.Application.DocumentSavedAs
rather than the DocumentSaved event.
It is raised even when document saving failed or was cancelled (during DocumentSaving event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' property in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of saving document has already been finished.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSaving
Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
Remarks:
This event is raised when Revit is just about to save the document.
Note that the first save of a newly created document will raise Autodesk.Revit.ApplicationServices.Application.DocumentSavingAs
rather than the DocumentSaving event.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
This event is cancellable, except when it is raised during close of the application.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.DocumentSaved will be raised immediately after the document has been saved.

Autodesk.Revit.ApplicationServices.ControlledApplication.FailuresProcessing
Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction.
Remarks:
This event is raised when failures are being processed during transaction commit or rollback operations.
Handlers of this event have a limited ability to modify the document and/or failures in it, using provided
restricted failures accessor interface.

Autodesk.Revit.ApplicationServices.ControlledApplication.WorksharedOperationProgressChanged
# Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central.
Remarks:
This event is only supported for Collaboration for Revit and will not be raised for those operations occurring in local-worksharing and Revit Server workflow.
Users may not change the document in the handler for this event.
If you do not need detailed progress information for synchronizing with central, see Autodesk::Revit::DB::Events::DocumentSynchronizingWithCentral or Autodesk::Revit::DB::Events::DocumentSynchronizedWithCentral.
It is NOT recommended to do any time-consuming work when handling DocumentSynchronizingWithCentralProgessChanged event. This can increase workshared operation time."
Exception Autodesk.Revit.Exceptions.ModificationForbiddenException will be thrown if any document-modifying method is called during this event's handler.
Since:
2017 Subscription Update

Autodesk.Revit.ApplicationServices.ControlledApplication.LinkedResourceOpened
Subscribe to the LinkedResourceOpened event to be notified immediately after Revit has finished opening a linked resource.
Remarks:
This event is raised immediately after Revit has finished opening a linked resource.
Only supports linked resources for following types : Revit; IFC; CAD(dwg, dxf, dgn, sat); Topography;
It is raised even when a linked resource opening failed.
The LinkedResourceOpened events would not raised if there are no update on linked CAD, IFC resources.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
Another Autodesk.Revit.ApplicationServices.Application.LinkedResourceOpening event will be raised when Revit is just about to
open a linked resource.
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.LinkedResourceOpening
Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource.
Remarks:
This event is raised when Revit is just about to open a linked resource.
Only supports linked resources for following types : Revit; IFC; CAD(dwg, dxf, dgn, sat);
This event would not be raised if there are no update on linked CAD, IFC resources.
Event is not cancellable.
The linked resource cannot be modified, for it is not opened yet at the time of the event.
Another Autodesk.Revit.ApplicationServices.Application.LinkedResourceOpened event will be raised immediately after
linked resource is opened.
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.GetFolderContentsRequested
# Subscribe to the GetFolderContentsRequested event to be notified when Revit requests for a list of cloud folder contents, containing subfolders and cloud models.
Remarks:
This event is only supported for listing ForgeDM folder contents via Collaboration for Revit and will not be raised for those operations occurring in local-worksharing and Revit Server workflow.
Since:
2019

Autodesk.Revit.ApplicationServices.ControlledApplication.GetProjectsRequested
# Subscribe to the GetProjectsRequested event to be notified when Revit requests for a list of cloud projects.
Remarks:
This event is only supported for listing ForgeDM projects via Collaboration for Revit and will not be raised for those operations occurring in local-worksharing and Revit Server workflow.
Since:
2019

Autodesk.Revit.ApplicationServices.ControlledApplication.GetHubsRequested
# Subscribe to the GetHubsRequested event to be notified when Revit requests for a list of cloud hubs.
Remarks:
This event is only supported for listing ForgeDM hubs via Collaboration for Revit and will not be raised for those operations occurring in local-worksharing and Revit Server workflow.
Since:
2019

Autodesk.Revit.ApplicationServices.ControlledApplication.PositionsSaved
Subscribe to the PositionsSaved event to be notified when linked symbols Positions (Shared Coordinates) saved during PositionsSaved operations.
Remarks:
This event is only supported for PositionsSaved operation for linked symbols.
Users may not change the document in the handler for this event.
It is NOT recommended to do any time-consuming work when handling PositionsSaved event."
Exception Autodesk.Revit.Exceptions.ModificationForbiddenException will be thrown if any document-modifying method is called during this event's handler.
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentChanged
Subscribe to the FailuresProcessingEvent event to be notified when Revit document has changed.
Remarks:
This event is raised whenever a Revit transaction is either committed, or undone or redone.
This is a read-only event, designed to allow you to keep external data in sync with the state of the Revit database.
To update the Revit database in response to changes in elements, use the IUpdater framework.

Autodesk.Revit.ApplicationServices.ControlledApplication.SetLibraryPaths(System.Collections.Generic.IDictionary{System.String,System.String})
Sets path information identifying where Revit searches for content.
Remarks:
The map that
is returned should contain a key that is purpose of the path, such as Material Libraries and the value
in the map is the fully qualified path to be used for that search path.
paths:
The map of library paths.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.GetLibraryPaths
Returns path information identifying where Revit searches for content.
Remarks:
The map that
is returned contains a key that is purpose of the path, such as Material Libraries and the value
in the map is the fully qualified path that is used for that search path.
Returns:
The map of library paths.
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.WriteJournalComment(System.String,System.Boolean)
Writes a comment to the Revit journal file
comment:
Text for journal comment
timeStamp:
If a time stamp should be included in the journal comment
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.ApplicationServices.ControlledApplication.RecordingJournalFilename
Retrieve the name of the journal file that Revit is currently recording to.
Remarks:  As Revit operates it keeps a log of operations that the user performs
within a file, known as a journal file. These files are useful for providing information
about the actions performed in a session and the state of Revit when a problem occurs.
These files are included during error reporting to Autodesk.

Autodesk.Revit.ApplicationServices.ControlledApplication.RegisterFailuresProcessor(Autodesk.Revit.DB.IFailuresProcessor)
Registers Revit application-wide instance of Failures Processor.
Remarks:
If there is previously registered Failures Processor, it gets discarded.
If you opt to register a FailuresProcessor for Revit, your processor will become the default error handler
for all Revit errors for the session. The standard Revit error dialog will not appear.
If you want to handle only specific failures but not all types of failures in your application,
subscribe to the FailuresProcessing event instead, or use FailuresPreprocessor interface
for the specific transaction.
processor:
Instance of Failures Processor to be used by the Revit Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.ApplicationServices.ControlledApplication.GetFailureDefinitionRegistry
Returns the instance of FailureDefinitionRegistry.
Returns:
The instance of FailureDefinitionRegistry.
Since:
2011

Autodesk.Revit.ApplicationServices.ControlledApplication.IsLateAddinLoading
Indicates whether this add-in is loaded on the fly or not. If it is loaded when is Revit starting up, it
is false, otherwise it should be true.

Autodesk.Revit.ApplicationServices.ControlledApplication
Represents the Autodesk Revit Application with no access to documents. It provides options
and other application wide data and settings for external applications OnStartup/OnShutdown.

Autodesk.Revit.ApplicationServices.ControlledApplication.GetFolderContentsRequested
Subscribe to the GetFolderContentsRequested event to be notified immediately when Revit requests for a list of cloud folder contents, containing subfolders and cloud models.
Remarks:
This event is raised to get information regarding Folder Contents within ForgeDM (Collaborate add-in).

Autodesk.Revit.ApplicationServices.ControlledApplication.GetProjectsRequested
Subscribe to the GetProjectsRequested event to be notified immediately when Revit requests for a list of cloud projects.
Remarks:
This event is raised to get information regarding Projects within ForgeDM (Collaborate add-in).

Autodesk.Revit.ApplicationServices.ControlledApplication.GetHubsRequested
Subscribe to the GetHubsRequested event to be notified immediately when Revit requests for a list of cloud hubs.
Remarks:
This event is raised to get information regarding Hubs within ForgeDM (Collaborate add-in).

Autodesk.Revit.ApplicationServices.ControlledApplication.PositionsSaved
Subscribe to the PositionsSaved event to be notified immediately after linked symbols Positions (Shared Coordinates) saved during "Save Positions' operations.
Remarks:
This event is only raised for shared coordinates changes saved to Revit links.
Users may not change the document in the handler for this event.
It is NOT recommended to do any time-consuming work when handling PositionsSaved event.
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.ElementTypeDuplicated
Subscribe to the ElementTypeDuplicated event to be notified immediately after Revit has finished duplicating an element type.
Remarks:
This event is raised immediately after Revit has finished duplicating an element type.
It is raised even when duplicating an element type failed or was cancelled (during ElementTypeDuplicating event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in the event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of duplicating an element type has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentWorksharingEnabled
Subscribe to the DocumentWorksharingEnabled event to be notified when a document has become workshared.
Remarks:
This event is raised when Revit has just enabled worksharing in the document.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.WorksharedOperationProgressChanged
Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central.
Remarks:
This event is only supported for Collaboration for Revit and will not be raised for those operations occurring in local-worksharing and Revit Server workflow.
Users may not change the document in the handler for this event.
It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time."
Exception Autodesk.Revit.Exceptions.ModificationForbiddenException will be thrown if any document-modifying method is called during this event's handler.
Since:
2017 Subscription Update

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSynchronizedWithCentral
Subscribe to the DocumentSynchronizedWithCentral event to be notified immediately after Revit has finished synchronizing a document with central model.
Remarks:
This event is raised immediately after Revit has finished synchronizing a document with central model.
It is raised even when document synchronizing with central model failed or was cancelled (during DocumentSynchronizingWithCentral event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of synchronizing a document with central model has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.ViewExported
Subscribe to the ViewExported event to be notified immediately after Revit has finished exporting a view of the document.
Remarks:
This event is raised immediately after Revit has finished exporting a view of the document.
It is raised only during accelerated export jobs, in which views are exported in parallel using a background process.
Accelerated export only occurs when exporting to DWF formats and not combining views into a single file.
It is raised even when view exporting failed.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action was successful or not.
This event is not cancellable, for the process of view exporting has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.ViewExporting
Subscribe to the ViewExporting event to be notified when Revit is just about to export a view of the document.
Remarks:
This event is raised when Revit is just about to export a view of the document.
It is raised only during accelerated export jobs, in which views are exported in parallel using a background process.
Accelerated export only occurs when exporting to DWF formats and not combining views into a single file.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk.Revit.DB.Document.Print()Autodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.ViewExported will be raised immediately after view exporting
is finished.
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.FileExported
Subscribe to the FileExported event to be notified immediately after Revit has finished exporting files of formats supported by the API.
Remarks:
This event is raised immediately after Revit has finished exporting files of formats supported by the API.
It is raised even when file exporting failed or was cancelled (during FileExporting event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
If export is a part of 'Publish to Buzzsaw' command which consists of two parts – export of a document followed by publishing it to a BuzzSaw server, the event status only reflects the result of the Export action. The publishing part of the command could still be cancelled or could fail after FileExported event is raised.
This event is not cancellable, for the process of exporting file has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentClosing
Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
Remarks:
This event is raised when Revit is just about to close a document.
This event is cancellable, except when it is raised as part of application closing.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to True to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document may not be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
An Autodesk.Revit.ApplicationServices.Application.DocumentClosed event will be raised immediately after document is closed.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.ViewPrinted
Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
Remarks:
This event is raised immediately after Revit has finished printing a view of the document.
If multiple views are combined to a single file, this event will be raised only once.
It is raised even when view printing failed.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action was successful or not.
This event is not cancellable, for the process of view printing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.ViewPrinting
Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
Remarks:
This event is raised when Revit is just about to print a view of the document.
If multiple views are combined to a single file, this event will be raised only once.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is not cancellable. The 'Cancellable' property of event's argument is always False.
The following API functions are not available for the current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk.Revit.DB.Document.Print()Autodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.ViewPrinted will be raised immediately after view printing
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentPrinted
Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
Remarks:
This event is raised immediately after Revit has finished printing a view or ViewSet of the document.
It is raised even when document printing failed or was cancelled (during DocumentPriting event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' field in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of printing has already been finished.
If the action was not successful, the document may not be modified and new transactions may not be started.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentPrinting
Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
Remarks:
This event is raised when Revit is just about to print a view or ViewSet of the document.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method of event's argument to True.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for current document during this event:
All overloads of Autodesk.Revit.DB.Document.Export()Autodesk::Revit::DB::Document::PrintAutodesk.Revit.DB.View.Print and similar overloads.Autodesk.Revit.DB.PrintManager.SubmitPrint and similar overloads.Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
After this event, for each view being printed, Autodesk.Revit.ApplicationServices.Application.ViewPrinting and Autodesk.Revit.ApplicationServices.Application.ViewPrinted events will be raised.
Another event Autodesk.Revit.DB.Document.DocumentPrinted will be raised immediately after document printing
is finished.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSavedAs
Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
Remarks:
This event is raised immediately after Revit has finished saving document with a new file name.
Note that the first save of a newly created document  will raise DocumentSavedAs rather than Autodesk.Revit.ApplicationServices.Application.DocumentSaved event.
It is raised even when document saving failed or was cancelled (during DocumentSavingAs event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' property in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of saving document has already been finished.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSavingAs
Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
Remarks:
This event is raised when Revit is just about to save the document with a new file name.
Note that the first save of a newly created document  will raise DocumentSavingAs rather than Autodesk.Revit.ApplicationServices.Application.DocumentSaving event.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
This event is cancellable, except when it is raised during close of the application.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.DocumentSavedAs will be raised immediately after the document has been saved with a new file name.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSaved
Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
Remarks:
This event is raised immediately after Revit has finished saving a document.
Note that the first save of a newly created document  will raise Autodesk.Revit.ApplicationServices.Application.DocumentSavedAs
rather than the DocumentSaved event.
It is raised even when document saving failed or was cancelled (during DocumentSaving event).
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
Check the 'Status' property in event's argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of saving document has already been finished.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentSaving
Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
Remarks:
This event is raised when Revit is just about to save the document.
Note that the first save of a newly created document will raise Autodesk.Revit.ApplicationServices.Application.DocumentSavingAs
rather than the DocumentSaving event.
Handlers of this event are permitted to make modifications to any document (including the active document),
except for documents that are currently in read-only mode.
This event is cancellable, except when it is raised during close of the application.
Check the 'Cancellable' property of event's argument to see whether it is cancellable or not.
When it is cancellable, call the 'Cancel()' method of event's argument to cancel it.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save .Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another event Autodesk.Revit.ApplicationServices.Application.DocumentSaved will be raised immediately after the document has been saved.
Since:
2010

Autodesk.Revit.ApplicationServices.ControlledApplication.FailuresProcessing
Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction.
Remarks:
This event is raised when failures are being processed during transaction commit or rollback operations.
Handlers of this event have a limited ability to modify the document and/or failures in it, using the provided
restricted failures accessor interface.
The event arguments provide access to the FailuresAccessor via
Autodesk::Revit::DB::FailuresProcessingEventArgs::GetFailuresAccessor()
which contains the details of the errors and/or warnings that caused the event to trigger.
The arguments also allow you to set a processing result via
Autodesk::Revit::DB::FailuresProcessingEventArgs::SetProcessingResult().  The processing
result determines if Revit will attempt to recommit the currently failing transaction, roll it back, or continue.
If you are explicitly dismissing warnings from the event callback, a processing result of Continue
is sufficient.  But if you are explicitly resolving errors from the event callback, you must change the
processing result to ProceedWithCommit to ensure that the user is not shown the dismissed errors.   If you
wish to cancel the transaction silently without showing the errors to the user, set the processing result to
ProceedWithRollback, however you must also call
Autodesk.Revit.DB.FailureHandlingOptions.SetClearAfterRollback(System.Boolean) in
order to dismiss the errors and silently cancel the transaction.
Since:
2011

Autodesk.Revit.ApplicationServices.ControlledApplication.DocumentChanged
Subscribe to the DocumentChanged event to be notified when Revit document has changed.
Remarks:
This event is raised whenever a Revit transaction is either committed, undone or redone.
This is a readonly event, designed to allow you to keep external data in synch with the state of the
Revit database.
To update the Revit database in response to changes in elements, use the IUpdater framework.
Since:
2011

Autodesk.Revit.ApplicationServices.ControlledApplication.ApplicationInitialized
Subscribe to this event to get notified after the Revit application has been initialized
Remarks:
The event is raised after Revit was launched as fully initialized,
including initialization of external applications.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.HasCloudModelEntitlement
Indicates if the current user has the cloud model entitlement (Cloud Model for Revit) or not.
Returns:
Returns true if the current user has the cloud model entitlement, otherwise returns false.
Since:
2019.2

Autodesk.Revit.ApplicationServices.ControlledApplication.HasWorksharedCloudModelEntitlement
Indicates if the current user has the workshared cloud model entitlement (BIM 360 Design) or not.
Returns:
Returns true if the current user has the workshared cloud model entitlement, otherwise returns false.
Since:
2019.2

Autodesk.Revit.ApplicationServices.ControlledApplication.HasBIM360Accounts
Indicates if the current login user has any BIM 360 accounts or not.
Returns:
Returns true if the current login user has any BIM 360 accounts, otherwise returns false.

Autodesk.Revit.ApplicationServices.ControlledApplication.IsOnSubscription
Indicates if this Revit is on subscription or not.
Returns:
Returns true if this Revit is on subscription, otherwise returns false.
Since:
2019

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenCloudCentralModel(Autodesk.Revit.DB.ModelPath,System.Boolean)
Opens a central document from cloud directly without creating a local cache
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
cloudPath:
The path to the cloud model to be opened.
doNotLoadLinks:
Whether or not loading links when opening the model
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session.You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied.A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the Skyscraper server is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension.Try changing the file's extension and opening it again.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The document can not be opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk::Revit::Exceptions::SkyscraperServerCommunicationException:
The skyscraper central model could not be accessed
because of a network communication error.
Throws Autodesk::Revit::Exceptions::SkyscraperServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.

Autodesk.Revit.ApplicationServices.ControlledApplication.IsDebugModeSet(System.String)
Determines if the specified debug mode is set.
modeName:
The debug mode name.
Returns:
True if the debug mode is set, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.GetAssets(Autodesk.Revit.DB.Visual.AssetType)
Gets all the Assets of the specified type.
assetType:
The asset type.
Returns:
Returns an array of all the Assets within Revit of the specified type.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2018.1

Autodesk.Revit.ApplicationServices.ControlledApplication.UpdateRenderAppearanceLibrary
Updates the stored render appearance library, giving the Revit session access to any new RPC content.
Since:
2014

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenDocumentFile(System.String)
Opens a document from disk.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
fileName:
The file to be opened.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The fileName to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The fileName to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The document can not be opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenDocumentFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions,Autodesk.Revit.DB.IOpenFromCloudCallback)
Opens a document from disk or cloud.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
modelPath:
The file to be opened.
openOptions:
Options for opening the file.
openFromCloudCallback:
The interface implementation to use when opening a cloud document. Only used for opening cloud model.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The modelPath to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the RevitServer is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The modelPath to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The cloud model is not saved in current release of Revit.
-or-
The document can not be opened.
-or-
Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2019

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenDocumentFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions)
Opens a document from disk or cloud.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
modelPath:
The file to be opened.
openOptions:
Options for opening the file.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The modelPath to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the RevitServer is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
-or-
File was saved by an application that was not developed or licensed by Autodesk.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The modelPath to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The cloud model is not saved in current release of Revit.
-or-
The document can not be opened.
-or-
Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
User is not authorized to access the cloud model.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsValidThickness(System.Double)
Checks if the input value is valid to be supplied as a thickness (for an extrusion, or blend, or wall layer, or similar geometric construct).
Remarks:
This checks two conditions:
The value is greater than or equal to the minimum thickness allowed in Revit for these types of geometric constructs. The value is less than or equal to the maximum length/distance allowed by Revit for elements.
thickness:
The input value.
Returns:
True if the input value is valid for thickness; false otherwise.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.GetRevitServerNetworkHosts
Gets the list of all Revit Server Network hosts in current session.
Remarks:
The list of Revit Server Network hosts is stored externally in the RSN[version].ini file.
Returns:
An array of names of all Revit Server Network hosts in current session.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.GetWorksharingCentralGUID(Autodesk.Revit.DB.ServerPath)
Gets the worksharing central GUID of the given server-based model.
Remarks:
The given server-based model saved in a release prior to Revit 2013 did not have this GUID.
Only the given server-based model saved in Revit 2013 or later will be able to provide this value.
serverModelPath:
The server-based model path.
Returns:
The worksharing central GUID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
Thrown when the given model is not created in Revit 2013 or later release.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.CopyModel(Autodesk.Revit.DB.ModelPath,System.String,System.Boolean)
Copies an existing model to a new file. Overwriting a file of the same name is allowed.
sourceModelPath:
The path of the file-based or server-based source model.
destFilePath:
The path of the destination file.
overwrite:
True if the destination file can be overwritten; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given path sourceModelPath is a cloud path which is not supported in this method.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory of destination file doesn't exist.
Throws Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException:
The destination file exists and can't be overwritten.
-or-
destFilePath is pointing to a folder that already exists and cannot be deleted.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The Revit model specified by sourceModelPath doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The destination file name includes one or more invalid characters.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.PurgeReleasedAPIObjects
Explicitly purges all API objects that have been released but are still awaiting to be finalized
Remarks:
Revit purges API objects automatically every time when command control returns from
an API application (an external command, event handler, etc.) back to Revit.
This is necessary because Revit does not allow API objects to be finalized when the
finalization is invoked from an outside thread (from the garbage collector, specifically).
This automatic purging is adequate in most scenarios. When an application uses a lot
of API objects during one single command though, it may be necessary or beneficial
to invoke an additional purge explicitly to free the deleted API objects from memory.
Since:
2011

Autodesk.Revit.ApplicationServices.ControlledApplication.WriteJournalComment(System.String,System.Boolean)
Writes a comment to the Revit journal file.
comment:
Text for journal comment.
timeStamp:
If a time stamp should be included in the journal comment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.ApplicationServices.ControlledApplication.NewProjectDocument(Autodesk.Revit.DB.UnitSystem)
Creates a new project document with no template file specified.
unitSystem:
The unit system used for the new document.
Returns:
The newly created document.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenIFCDocument(System.String,Autodesk.Revit.DB.IFC.IFCImportOptions)
Opens an IFC document from disk using custom options.
fileName:
The IFC file to be opened.
importOptions:
The options for this import.
Returns:
The newly created document containing the IFC file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
If 'fileName' is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
If the file specified by 'fileName' cannot be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If Revit is missing document templates or if the file cannot be opened.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenIFCDocument(System.String)
Opens an IFC document from disk using default options.
fileName:
The IFC file to be opened.
Returns:
The newly created document containing the IFC file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
If 'fileName' is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'fileName'
-or-
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
If the file specified by 'fileName' cannot be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If Revit is missing document templates or if the file cannot be opened.

Autodesk.Revit.ApplicationServices.ControlledApplication.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.ApplicationServices.ControlledApplication.AllowNavigationDuringRedraw
Checks whether or not the navigation during redraw is enabled, and enable or disable it.
Since:
2016

Autodesk.Revit.ApplicationServices.ControlledApplication.LoginUserId
The user id of the user currently logged in. The user id will be empty
if the user is not logged in.
Remarks:
The internal id of Autodesk ID that the current user has logged in to A360.
This user id is in human unrecognizable form. In conjunction with the Store Entitlement REST
API, a publisher of Autodesk Exchange Store app can verify if the current user has purchased
their app from the store. For more information about Store Entitlement API, please refer
to www.autodesk.com/developapps.
Since:
2016

Autodesk.Revit.ApplicationServices.ControlledApplication.IsLoggedIn
Checks if the user is logged in from this session to their Autodesk account.
Since:
2016

Autodesk.Revit.ApplicationServices.ControlledApplication.BackgroundColor
The background color to use for model views in this session.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The backgroundColor argument does not represent a valid color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUsersAddinsDataFolderPath
Path to AddinsData folder for the current user.
Remarks:
Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]\AddinsData
Since:
2019

Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUsersDataFolderPath
Path to data folder for the current user.
Remarks:
Similar to C:\Users\[UserName]\AppData\Roaming\Autodesk\[ProductType]\[ReleaseName]
Since:
2019

Autodesk.Revit.ApplicationServices.ControlledApplication.AllUsersAddinsLocation
The folder location for .addin files for all users.
Since:
2014

Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUserAddinsLocation
The folder location for .addin files for the current user.
Since:
2014

Autodesk.Revit.ApplicationServices.ControlledApplication.MinimumThickness
The minimum thickness allowed in Revit for a variety of geometric constructs. These include blends, extrusions, and wall layers.
Remarks:
Do not use this value for any purpose other than its intended purpose.
If you want to check for valid thickness value, use the function isValidThickness.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.ShortCurveTolerance
The enforced minimum length for any curve created by Revit.
Since:
2014

Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentRevitServerAccelerator
Current Revit Server accelerator.
Remarks:
Revit connects with Revit Server hosts via current Revit Server accelerator.
If current Revit Server accelerator is not set, this will be an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The server name can not be used to construct a well formed Uri string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: When setting the value, Revit failed to write current Revit Server accelerator to the user environment.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsPipingAnalysisEnabled
Checks whether or not piping analysis is enabled, and enable or disable it.
Remarks:
Enabling piping analysis will not take effect unless the piping discipline is also enabled.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsElectricalAnalysisEnabled
Checks whether or not electrical analysis is enabled, and enable or disable it.
Remarks:
Enabling electrical analysis will not take effect unless the electrical discipline is also enabled.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsMechanicalAnalysisEnabled
Checks whether or not mechanical analysis is enabled, and enable or disable it.
Remarks:
Enabling mechanical analysis will not take effect unless the mechanical discipline is also enabled.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsPipingEnabled
Checks whether or not the piping discipline is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsElectricalEnabled
Checks whether or not the electrical discipline is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsMechanicalEnabled
Checks whether or not the mechanical discipline is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsStructuralAnalysisEnabled
Checks whether or not the structural analysis is enabled, and enable or disable it.
Remarks:
When structural analysis is disabled the structural analytical model will not be updated
automatically by Revit.  Enabling structural analysis will not take effect unless the structure discipline is also enabled.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsEnergyAnalysisEnabled
Checks whether or not energy analysis is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsMassingEnabled
Checks whether or not the massing and site tools are enabled, and enable or disable them.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsSystemsEnabled
Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsStructureEnabled
Checks whether or not the structure discipline is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.IsArchitectureEnabled
Checks whether or not the architecture discipline is enabled, and enable or disable it.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.AngleTolerance
Angle tolerance.
Remarks:
Value is in radians.
Two angle measurements closer than this value are considered identical.
Do not use this value for any purpose other than its intended purpose,
which is to check if two angles are the same within this tolerance value.
Do not use this value to set the value of an angle.
Doing so will result in unstable behavior.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.VertexTolerance
Vertex tolerance.
Remarks:
Two points within this distance are considered coincident.
Do not use this value for any purpose other than its intended purpose,
which is to check if two points are the same within this tolerance value.
Do not use this value to set the distance between two points.
Doing so will result in unstable behavior.
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.DefaultViewDiscipline
The view discipline that will be applied to new views by default.
Remarks:
This view discipline may be overridden by a view template when a view template is also applied to new views.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This functionality is not available in Revit LT.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.ShowGraphicalWarningHangerDisconnects
Whether or not to show the graphical warnings for Fabrication Hanger disconnects.
Since:
2016

Autodesk.Revit.ApplicationServices.ControlledApplication.ShowGraphicalWarningElectricalDisconnects
Whether or not to show the graphical warnings for Electrical disconnects.
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.ShowGraphicalWarningCableTrayConduitDisconnects
Whether or not to show the graphical warnings for CTC disconnects.
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.ShowGraphicalWarningPipeDisconnects
Whether or not to show the graphical warnings for Pipe disconnects.
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.ShowGraphicalWarningDuctDisconnects
Whether or not to show the graphical warnings for duct disconnects.
Since:
2012

Autodesk.Revit.ApplicationServices.ControlledApplication.ImportIFCCategoryTable
Full path to the file that defines IFC entity to Revit category mappings for IFC import.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.ExportIFCCategoryTable
Full path to the file that defines Revit category to IFC entity mappings for IFC export.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.DefaultIFCProjectTemplate
Full path to the default template file for new IFC project documents.
It may be empty, in which case the DefaultProjectTemplate should be used.
Since:
2015

Autodesk.Revit.ApplicationServices.ControlledApplication.DefaultProjectTemplate
Full path to the default template file for new project documents.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.PointCloudsRootPath
Root path for point cloud files.
Since:
2016

Autodesk.Revit.ApplicationServices.ControlledApplication.FamilyTemplatePath
Default path for family template files.
Since:
2011

Autodesk.Revit.ApplicationServices.ControlledApplication.SubVersionNumber
The minor version number of Revit
Remarks:
SubVersionNumber of Revit may have additional APIs and functionality not available in the standard customer releases.
Add-ins written to support standard Revit releases should be compatible with SubVersionNumber releases,
but add-ins written specifically targeting new features in SubVersionNumber releases would not be compatible with the standard releases.
Since:
2018

Autodesk.Revit.ApplicationServices.ControlledApplication.IsSubscriptionUpdate
True if this version of Revit is a subscription update.
Remarks:
Subscription update releases may have additional APIs and functionality not available in the standard customer releases.
Add-ins written to support standard Revit releases should be compatible with subscription updates,
but add-ins written specifically targeting new features in subscription updates would not be compatible with the standard releases.
Since:
2015 Subscription Update

Autodesk.Revit.ApplicationServices.ControlledApplication.Username
Gets the user name for the current Revit session.
Since: 2012

Autodesk.Revit.ApplicationServices.ControlledApplication.ActiveAddInId
Retrieves the Id of the currently running external application.
Remarks:
The application can be either a UI application, DB application, or an external command. If no addin is active, this property will return null.
If an event handler is currently being executed, the returned value will be the Id of the application or command in which the event handler was registered.

Autodesk.Revit.ApplicationServices.ControlledApplication.SharedParametersFilename
Contains the fully qualified path to a shared parameters file.
Remarks: This path can be read and set via this property. By default Autodesk Revit does not have
a shared parameters file so this property must be set before access is made to the shared parameters
file object otherwise an exception will be thrown.

Autodesk.Revit.ApplicationServices.ControlledApplication.Product
The product type for the current session of Revit.

Autodesk.Revit.ApplicationServices.ControlledApplication.Language
The language used in the current session of Revit.
Remarks: Use this property to determine the language used by Revit; this can allow your application to load the appropriate resources.

Autodesk.Revit.ApplicationServices.ControlledApplication.Cities
Returns a set of all the known city locations within Revit.
Remarks: Each city has information about longitude, latitude etc.

Autodesk.Revit.ApplicationServices.ControlledApplication.VersionBuild
Returns the internal build number of the Autodesk Revit application.
Remarks:  This property can be used by your application to find the version of Autodesk Revit
against which your application is running. Based on this information your application
can report if it is able to work correctly with that version of Autodesk Revit.

Autodesk.Revit.ApplicationServices.ControlledApplication.VersionNumber
Return the primary version of the Revit application.
Remarks:  This property can be used by your application to find the version of Revit
against which your application is running. Based on this information your application
can report if it is able to work correctly with that version of Revit.

Autodesk.Revit.ApplicationServices.ControlledApplication.VersionName
Returns the name of the Revit application.
Remarks:  This property can be used by your application to find the version of Revit
against which your application is running. Based on this information your application
can report if it is able to work correctly with that version of Revit.

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenSharedParameterFile
Enables access to shared parameter groups and definitions that are maintained on disk.
Returns: An object that represents a shared parameters file that exists on disk. Returns null if the file does not exist.
Remarks: This function is used to return an object that represents a Revit shared parameters file
Revit can use only one shared parameters file at one time. The filename
for the shared parameters file can be set in the Application.SharedParametersFilename property.

Autodesk.Revit.ApplicationServices.ControlledApplication.Create
Provides an object that can be used to create new instances of Autodesk Revit API objects.
Remarks: The Create property returns an object that is used to create application wide utility
and geometric objects within the Autodesk Revit API, such as arrays, sets, lines. This object
should be used when you wish to create an object within the Autodesk Revit application memory,
rather than your own application's memory. If you are performing your own memory management
techniques then it is advisable to create any utility objects via the Create object. For example:
Instead of Dim set As New Autodesk_Revit_ElementSet do Set set = application.Create.NewElementSet()

Autodesk.Revit.ApplicationServices.ControlledApplication.RecordingJournalFilename
Retrieve the name of the journal file the Revit is currently recording to.
Remarks:  As Revit operates it keeps a log of operations that the user performs
within a file, known as a journal file. These files provide information
about the actions performed in a session and the state of Revit when a problem occurs.
These files are included during error reporting to Autodesk.

Autodesk.Revit.ApplicationServices.ControlledApplication.ExtractPartAtomFromFamilyFile(System.String,System.String)
Writes a PartAtom XML from the contents of a family file.
familyFilePath: The family file to be processed.
xmlFilePath: The xml file to be saved.
Throws Autodesk.Revit.Exceptions.ArgumentException:
If 'familyFilePath' or 'xmlFilePath' is null or an empty string or if the family file doesn't exist on disk.
Remarks:
If there is a TXT type catalog next to the family file (a TXT file with the same name as the RFA file),
the function will read it as well and process its contents into PartAtom.
To extract a PartAtom XML from a family loaded into a document in session, use Family.ExtractPartAtom().

Autodesk.Revit.ApplicationServices.ControlledApplication.OpenBuildingComponentDocument(System.String)
Opens a Building Component document from disk.
Remarks:  The opened document is a family document.
fileName: The Building Component file to be opened.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: If null is passed as 'fileName'.
Throws Autodesk.Revit.Exceptions.ArgumentException:  If 'fileName' is an empty string or it is not an Autodesk Exchange file name.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException: If the file specified by 'fileName' cannot be found.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the Building Component file cannot be opened.

Autodesk.Revit.ApplicationServices.ControlledApplication.NewFamilyDocument(System.String)
New family document, including family, titleblock, and annotation symbol
templateFileName: The template file name.
Throws Autodesk.Revit.Exceptions.ArgumentException: If 'templateFileName' is null or an empty string.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the new family document cannot be created.
Remarks:  This command corresponds to File->New->Family.../TitleBlock.../Annotation Symbol....

Autodesk.Revit.ApplicationServices.ControlledApplication.NewProjectTemplateDocument(System.String)
New project template document
templateFilename: The template file name.
Throws Autodesk.Revit.Exceptions.ArgumentException: If 'templateFileName' is null or an empty string.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the project template document cannot be created.
Remarks:  This command corresponds to New->Project->Project Template command in the user-interface.

Autodesk.Revit.ApplicationServices.ControlledApplication.NewProjectDocument(System.String)
New project document
templateFileName: The template file name.
Throws Autodesk.Revit.Exceptions.ArgumentException: If 'templateFileName' is null or an empty string.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the new project document cannot be created.
Remarks:  This command corresponds to New->Project command in the user-interface.

Autodesk.Revit.ApplicationServices.ControlledApplication.Documents
Returns a set of documents within Revit.
Remarks:  This property can be used for the user to find all the document inside Revit.

Autodesk.Revit.ApplicationServices.ControlledApplication.Assets(Autodesk.Revit.DB.Visual.AssetType)
Returns a set of all the Assets within Revit of special type.
Remarks: Each Asset stores the information for rendering etc.